### Total: 17

2016
- 8

2020
- 9

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('ub_w.csv')

## 2016

1. liya mustafina (RUS) 
2. madison kocian (USA) 	
3. sophie scheder (GER)

## 2020

1. nina derwael (BEL) 	
2. anastasia ilyankova (ROC)  - 1 comp	
3. sunisa lee (USA) - 1 comp

In [3]:
df['year'].value_counts()

year
2023    644
2022    586
2021    200
2015    197
2019    109
2014     54
2013     46
2018     16
2020      8
2011      8
2017      8
2016      8
Name: count, dtype: int64

In [4]:
df = pd.read_csv('ub_w.csv')
df['Name'] = df['Name'].str.lower()

In [5]:
df['Name'] = df['Name'].str.lower()

In [6]:
df12 = df[df['year'].isin([2011])].copy()
df16 = df[df['year'].isin([2013, 2014, 2015, 2016])].copy()
df20 = df[df['year'].isin([2017, 2018, 2019, 2020])].copy()
df24 = df[df['year'].isin([2022, 2023])].copy()

In [7]:
# # Define a function to assign medal values based on the "Name" column
# def assign_medal(name):
#     name_lower = name.lower()
#     if name_lower == 'aliya mustafina':
#         return 3
#     elif name_lower == 'madison kocian':
#         return 2
#     elif name_lower == 'sophie scheder':
#         return 1
#     else:
#         return -1

# # Apply the function to create the "medal" column
# df16['medal'] = df16['Name'].apply(assign_medal)

In [8]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'aliya mustafina':
        return 1
    elif name_lower == 'madison kocian':
        return 1
    elif name_lower == 'sophie scheder':
        return 1
    else:
        return 0

# Apply the function to create the "medal" column
df16['medal'] = df16['Name'].apply(assign_medal)

In [9]:
df16['medal'].value_counts()

medal
0    297
1      8
Name: count, dtype: int64

In [10]:
df16[df16['Name']== 'aliya mustafina']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
1432,3.0,aliya mustafina,RUS,6.5,8.533,0.0,15.033,2013,final,1
1443,6.0,aliya mustafina,RUS,6.3,8.800,0.0,15.100,2014,final,1

In [11]:
df16[df16['Name']== 'madison kocian']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
1449,1.0,madison kocian,USA,6.6,8.766,0.0,15.366,2015,final,1
1703,2.0,madison kocian,USA,6.3,8.525,0.0,14.825,2014,final,1

In [12]:
df16[df16['Name']== 'sophie scheder']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
1363,5.0,sophie scheder,GER,6.2,7.100,0.0,13.300,2013,final,1
1368,2.0,sophie scheder,GER,6.2,8.100,0.0,14.300,2013,qual,1
1434,5.0,sophie scheder,GER,6.4,8.283,0.0,14.683,2013,final,1
1453,8.0,sophie scheder,GER,6.6,8.000,0.0,14.600,2015,final,1

In [13]:
# def assign_medal(name):
#     name_lower = name.lower()
#     if name_lower == 'nina derwael':
#         return 3
#     elif name_lower == 'anastasia ilyankova':
#         return 2
#     elif name_lower == 'sunisa lee':
#         return 1
#     else:
#         return -1

# # Apply the function to create the "medal" column
# df20['medal'] = df20['Name'].apply(assign_medal)

In [14]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'nina derwael':
        return 1
    elif name_lower == 'anastasia ilyankova':
        return 1
    elif name_lower == 'sunisa lee':
        return 1
    else:
        return 0

# Apply the function to create the "medal" column
df20['medal'] = df20['Name'].apply(assign_medal)

In [15]:
df20['medal'].value_counts()

medal
0    132
1      9
Name: count, dtype: int64

In [16]:
# Assuming you have a DataFrame named 'df'
name_counts = df16['Name'].value_counts()

# Print the counts for each name
print("aliya Mustafina:", name_counts.get("aliya mustafina", 0))
print("Madison Kocian:", name_counts.get("madison kocian", 0))
print("Sophie Scheder:", name_counts.get("sophie scheder", 0))

aliya Mustafina: 2
Madison Kocian: 2
Sophie Scheder: 4

In [17]:
# Assuming you have a DataFrame named 'df'
name_counts = df20['Name'].value_counts()

print("nina derwael:", name_counts.get("nina derwael", 0))
print("anastasia ilyankova:", name_counts.get("anastasia ilyankova", 0))
print("sunisa lee:", name_counts.get("sunisa lee", 0))

nina derwael: 7
anastasia ilyankova: 1
sunisa lee: 1

In [18]:
combined_df = pd.concat([df20, df16], axis=0)

In [19]:
df = combined_df.copy()

In [20]:
df['medal'].value_counts()

medal
0    429
1     17
Name: count, dtype: int64

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 446 entries, 1271 to 1883
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     446 non-null    float64
 1   Name     446 non-null    object
 2   nation   446 non-null    object
 3   D Score  446 non-null    float64
 4   E Score  446 non-null    float64
 5   Pen.     446 non-null    float64
 6   Total    446 non-null    float64
 7   year     446 non-null    int64
 8   round    446 non-null    object
 9   medal    446 non-null    int64
dtypes: float64(5), int64(2), object(3)
memory usage: 38.3+ KB

In [22]:
from sklearn.preprocessing import LabelEncoder

# Assuming df is your DataFrame and 'Name' is the column you want to encode
le = LabelEncoder()

# Fit and transform the 'Name' column to create integer labels
df['Name_encoded'] = le.fit_transform(df['Name'])

# Store the mapping between integers and original objects
label_mapping = dict(zip(le.transform(df['Name']), df['Name']))

# To revert the integers back to objects, use the label_mapping
# reverted_names = df['Name_encoded'].map(label_mapping)

In [23]:
df=df.drop(columns=["Name"])

In [24]:
# Assuming df is your DataFrame
df.rename(columns={'Name_encoded': 'Name'}, inplace=True)

In [25]:
from sklearn.preprocessing import LabelEncoder

# Assuming df is your DataFrame and 'Name' is the column you want to encode
le = LabelEncoder()

# Fit and transform the 'Name' column to create integer labels
df['nation_encoded'] = le.fit_transform(df['nation'])

# Store the mapping between integers and original objects
label_mapping_nation = dict(zip(le.transform(df['nation']), df['nation']))

# To revert the integers back to objects, use the label_mapping
# reverted_names = df['Name_encoded'].map(label_mapping)

In [26]:
df=df.drop(columns=["nation"])

In [27]:
# Assuming df is your DataFrame
df.rename(columns={'nation_encoded': 'nation'}, inplace=True)

In [28]:
df.nunique()

Rank        85
D Score     51
E Score    165
Pen.         3
Total      218
year         8
round        5
medal        2
Name       277
nation      76
dtype: int64

In [29]:
# Assuming df is your DataFrame
df['round'] = df['round'].str.lower()

In [30]:
df['Total'].nunique()

218

In [31]:
df['D Score'].nunique()

51

In [32]:
df['E Score'].nunique()

165

In [33]:
6.5/8.533

0.761748505801008

In [34]:
8.533/6.5

1.3127692307692307

In [35]:
df.head()

      Rank  D Score  E Score  Pen.   Total  year  round  medal  Name  nation
1271   1.0      6.5    8.533   0.0  15.033  2019  final      1   208       6
1272   2.0      6.5    8.433   0.0  14.933  2019  final      0   103      12
1273   3.0      6.3    8.400   0.0  14.700  2019  final      0    21      55
1274   4.0      6.0    8.216   0.0  14.216  2019  final      0   140      61
1275   5.0      6.0    8.000   0.0  14.000  2019  final      0   148      24

In [36]:
df['total_D'] = df['Total'] / df['D Score']
df['total_E'] = df['Total'] / df['E Score']
df['D_E'] =  df['E Score'] / df['D Score']

In [37]:

df_encoded = pd.get_dummies(df, columns=['round'], prefix='round')

In [38]:
df_encoded.info()

<class 'pandas.core.frame.DataFrame'>
Index: 446 entries, 1271 to 1883
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           446 non-null    float64
 1   D Score        446 non-null    float64
 2   E Score        446 non-null    float64
 3   Pen.           446 non-null    float64
 4   Total          446 non-null    float64
 5   year           446 non-null    int64
 6   medal          446 non-null    int64
 7   Name           446 non-null    int64
 8   nation         446 non-null    int64
 9   total_D        446 non-null    float64
 10  total_E        446 non-null    float64
 11  D_E            446 non-null    float64
 12  round_final    446 non-null    bool
 13  round_qual     446 non-null    bool
 14  round_unknown  446 non-null    bool
dtypes: bool(3), float64(8), int64(4)
memory usage: 46.6 KB

In [39]:

df_encoded['tot_final']=df_encoded['round_final']+df_encoded['Total']
df_encoded['tot_fin_d'] = df_encoded['tot_final'] * df_encoded['D Score']
df_encoded['tot_fin_ddiv'] = df_encoded['D Score'] / df_encoded['tot_final']

In [40]:
correlations = df_encoded.corrwith(df['medal'])

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 446 entries, 1271 to 1883
Data columns (total 13 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     446 non-null    float64
 1   D Score  446 non-null    float64
 2   E Score  446 non-null    float64
 3   Pen.     446 non-null    float64
 4   Total    446 non-null    float64
 5   year     446 non-null    int64
 6   round    446 non-null    object
 7   medal    446 non-null    int64
 8   Name     446 non-null    int64
 9   nation   446 non-null    int64
 10  total_D  446 non-null    float64
 11  total_E  446 non-null    float64
 12  D_E      446 non-null    float64
dtypes: float64(8), int64(4), object(1)
memory usage: 48.8+ KB

In [42]:
correlations.sort_values(ascending=False)

medal            1.000000
tot_fin_d        0.279685
tot_final        0.246066
D Score          0.239582
Total            0.229803
round_final      0.204005
E Score          0.165649
Name             0.108043
total_E          0.097242
nation           0.045960
year             0.031364
Pen.             0.020258
round_unknown   -0.038399
tot_fin_ddiv    -0.044574
total_D         -0.073388
D_E             -0.073456
Rank            -0.145906
round_qual      -0.184716
dtype: float64

In [43]:
# medals: 0 or 1
# # medal            1.000000
# # D Score          0.239582
# # Total            0.229803
# # round_final      0.204005
# # E Score          0.165649
# # Name             0.108043
# # nation           0.045960
# # year             0.031364
# # Pen.             0.020258
# # round_unknown   -0.038399
# # Rank            -0.145906
# # round_qual      -0.184716
# # dtype: float64

In [44]:
# medals: 3, 2, 1, 0
# medal            1.000000
# D Score          0.226139
# Total            0.222609
# round_final      0.186404
# E Score          0.165968
# year             0.072862
# Name             0.072479
# nation           0.045566
# Pen.             0.018810
# round_unknown   -0.035655
# Rank            -0.138958
# round_qual      -0.168561
# dtype: float64

In [45]:
df_encoded.info()

<class 'pandas.core.frame.DataFrame'>
Index: 446 entries, 1271 to 1883
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           446 non-null    float64
 1   D Score        446 non-null    float64
 2   E Score        446 non-null    float64
 3   Pen.           446 non-null    float64
 4   Total          446 non-null    float64
 5   year           446 non-null    int64
 6   medal          446 non-null    int64
 7   Name           446 non-null    int64
 8   nation         446 non-null    int64
 9   total_D        446 non-null    float64
 10  total_E        446 non-null    float64
 11  D_E            446 non-null    float64
 12  round_final    446 non-null    bool
 13  round_qual     446 non-null    bool
 14  round_unknown  446 non-null    bool
 15  tot_final      446 non-null    float64
 16  tot_fin_d      446 non-null    float64
 17  tot_fin_ddiv   446 non-null    float64
dtypes: bool(3), float64(11), int64(4)
memory usage: 57.1 KB

In [46]:
# df_encoded.to_csv('ub_encoded.csv', index=False)